Reports/Renault_внИсторияИзмененийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>Renault_внИсторияИзмененийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыбранныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Catalogs/Renault_внКэшЖурналаРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_внКэшЖурналаРегистрации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>// дата изменения объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>// кто изменил</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>// на каком компьютере изменили</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИДОбъекта</Name>
					<Comment>// уникальный идентификатор объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетаданныеОбъекта</Name>
					<Comment>// метаданные измененного объекта строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Comment>// представление объекта при изменении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Comment>// событие, чилсо</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМетаданных</Name>
					<Comment>// тип метаданных, число</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часть</Name>
					<Comment>// часть объекта сохраненного в кэше</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелРИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_внУзлыРИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>внИзменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРеквизита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Renault_внИсторияИзмененийОбъектов/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВнешниеДанные = ПолучитьДанныеВнешнихНаборов(ВыбранныйОбъект);
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Данные", ВнешниеДанные);

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ТекСхема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ТекСхема, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();

	// Обработка данных в ДокументРезультат
    НачальнаяСтрока = 6;
	НачальныйСтолбец = 2;
	
	ЦветИзменено = WebЦвета.Персиковый;
	//ЦветУдалено = WebЦвета.СветлоРозовый;
	ЦветДобавлено = WebЦвета.СветлоЗеленый;
	
	Для Строка = НачальнаяСтрока По ДокументРезультат.ВысотаТаблицы Цикл
		ОбластьСтрока = ДокументРезультат.Область("R" + Формат(Строка, "ЧН=0; ЧГ="));
		Если ОбластьСтрока.Отступ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Столбец = НачальныйСтолбец По ДокументРезультат.ШиринаТаблицы Цикл
			
			ПредОбласть = ДокументРезультат.Область(Строка, Столбец - 1, Строка, Столбец - 1);
			Область = ДокументРезультат.Область(Строка, Столбец, Строка, Столбец);
			
			Если ПредОбласть.Текст <> Область.Текст Тогда
				
				Если ПустаяСтрока(ПредОбласть.Текст) Тогда
					
					// Определяем было ли до этого в не пустой клетке подобное значение
					Найдено = Ложь;
					Индекс = Столбец - 1;
					Пока Индекс >= НачальныйСтолбец Цикл
						ПредОбласть = ДокументРезультат.Область(Строка, Индекс, Строка, Индекс);
						Если НЕ ПустаяСтрока(ПредОбласть.Текст) Тогда
							Найдено = Истина;
							Если ПредОбласть.Текст <> Область.Текст Тогда
								Область.ЦветФона = ЦветИзменено;
							КонецЕсли;
							Прервать;
						КонецЕсли;
						Индекс = Индекс - 1;
					КонецЦикла;
					
					Если НЕ Найдено Тогда
						Область.ЦветФона = ЦветДобавлено;
					КонецЕсли;
				ИначеЕсли НЕ ПустаяСтрока(Область.Текст) И Столбец <> НачальныйСтолбец Тогда
					Область.ЦветФона = ЦветИзменено;
				ИначеЕсли Столбец = НачальныйСтолбец И НЕ ПустаяСтрока(Область.Текст) Тогда
					Область.ЦветФона = ЦветДобавлено;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;		
	КонецЦикла;
    
	
КонецПроцедуры

// Возвращает ТЗ с данными по объектам
Функция ПолучитьДанныеВнешнихНаборов(ВыбранныйОбъект)
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("ИмяТЧ", 				Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("ИмяТЧОписание", 		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("ИмяРеквизита", 		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("ИмяРеквизитаОписание", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("НомерСтрокиТЧ", 		Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТЗ.Колонки.Добавить("НомерСтрокиТЧОписание",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("НомерВерсии", 			Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТЗ.Колонки.Добавить("НомерВерсииОписание",	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));

	ТЗ.Колонки.Добавить("Значение",				Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("Представление",		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("ДатаИзменения",		Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	// ЗАПОЛНЯЕМ ДАННЫЕ ИЗ MS SQL
	// Сначала данные из внешней базы
	
	внСоединение = Renault_внОбщийМодуль.ПолучитьСоединение();
	Если внСоединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписей = Новый COMОбъект("ADODB.Recordset");
	НаборЗаписей.CursorLocation = 2;
	
	ТекстЗапроса = 
		"SELECT journ.datechange, users.caption as username, computers.caption as computername, journ.object_guid, journ.ver + 1 as ver, journ.uid, props.nametp, props.namerec, journ_rec.newview, journ_rec.numtp, journ_rec.newval FROM journ_rec
		|LEFT OUTER JOIN journ ON journ.uid = journ_rec.journ_uid
		|LEFT OUTER JOIN users ON users.uid = journ.user_uid
		|LEFT OUTER JOIN computers ON computers.uid = journ.computer_uid
		|LEFT OUTER JOIN props ON props.uid = journ_rec.prop_uid
		|WHERE journ.object_guid = '" + Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(ВыбранныйОбъект) + "'
		|ORDER BY journ.datechange, journ.uid, props.nametp, journ_rec.numtp, props.namerec"
	;
	
	// Соединяемся с SQL если нужно
	Ошибка = Ложь;
	СтрОшибки = "";
	Попытка
		НаборЗаписей.Open(ТекстЗапроса, внСоединение);
	Исключение		
		Ошибка = Истина;
		СтрОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ВнешнийЖурналРегистрации", УровеньЖурналаРегистрации.Ошибка, СтрОшибки);
		Возврат ТЗ;
	КонецПопытки;	
			
	Пока НаборЗаписей.EOF = 0 Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		Попытка
			НоваяСтрока.Объект = Renault_внОбщийМодуль.ЗначениеИзСтрокиВнутрСервер(НаборЗаписей.Fields("object_guid").Value);
		Исключение
			НоваяСтрока.Объект = НаборЗаписей.Fields("object_guid").Value;
		КонецПопытки;
		
		НоваяСтрока.ИмяРеквизита = НаборЗаписей.Fields("namerec").Value;// Выборка.ИмяРеквизита;
		
		Если НЕ ПустаяСтрока(НаборЗаписей.Fields("nametp").Value) Тогда
			НоваяСтрока.ИмяТЧ = НаборЗаписей.Fields("nametp").Value;
			НоваяСтрока.НомерСтрокиТЧ = НаборЗаписей.Fields("numtp").Value;
		КонецЕсли;
		
		НоваяСтрока.Значение = НаборЗаписей.Fields("newval").Value;
		НоваяСтрока.Представление = НаборЗаписей.Fields("newview").Value;
		ДатаВФорматеSQL = НаборЗаписей.Fields("datechange").Value;
		НоваяСтрока.ДатаИзменения = ДатаВФорматеSQL;
		
		НоваяСтрока.НомерВерсии = НаборЗаписей.Fields("ver").Value;
		НоваяСтрока.НомерВерсииОписание = 
			"Версия из БД №" + Строка(НоваяСтрока.НомерВерсии) + Символы.ПС + 
			НаборЗаписей.Fields("username").Value + " (" + НаборЗаписей.Fields("computername").Value + ")" + Символы.ПС + 
			Формат(НоваяСтрока.ДатаИзменения, "ДЛФ=DT") + " (БД)";
					
		// Переходим к следующей
		НаборЗаписей.MoveNext();
	КонецЦикла;
	внСоединение.Close();
	
	
	// ЗАПОЛНЯЕМ ДАННЫЕ ИЗ КЭША
	// Данные из кэша
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.ГУИДОбъекта КАК ГУИДОбъекта,
		|	внКэшЖурналаРегистрацииИзменения.ИмяТЧ КАК ИмяТЧ,
		|	внКэшЖурналаРегистрацииИзменения.ИмяРеквизита КАК ИмяРеквизита,
		|	внКэшЖурналаРегистрацииИзменения.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.Компьютер,
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.Пользователь,
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.ДатаИзменения КАК ДатаИзменения,
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.Код КАК Код,
		|	внКэшЖурналаРегистрацииИзменения.Представление КАК ПредставлениеНовое,
		|	внКэшЖурналаРегистрацииИзменения.Значение КАК ЗначениеНовое
		|ИЗ
		|	Справочник.Renault_внКэшЖурналаРегистрации.внИзменения КАК внКэшЖурналаРегистрацииИзменения
		|ГДЕ
		|	внКэшЖурналаРегистрацииИзменения.Ссылка.ГУИДОбъекта = &ГУИДОбъекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГУИДОбъекта,
		|	ДатаИзменения,
		|	Код,
		|	ИмяТЧ,
		|	НомерСтрокиТЧ,
		|	ИмяРеквизита"
	);
	
	Запрос.УстановитьПараметр("ГУИДОбъекта", Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(ВыбранныйОбъект));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		Попытка
			НоваяСтрока.Объект = Renault_внОбщийМодуль.ЗначениеИзСтрокиВнутрСервер(Выборка.ГУИДОбъекта);
		Исключение
			НоваяСтрока.Объект = Выборка.ГУИДОбъекта;
		КонецПопытки;
		
		НоваяСтрока.ИмяРеквизита = Выборка.ИмяРеквизита;
		
		Если НЕ ПустаяСтрока(Выборка.ИмяТЧ) Тогда
			НоваяСтрока.ИмяТЧ = Выборка.ИмяТЧ;
			НоваяСтрока.НомерСтрокиТЧ = Выборка.НомерСтрокиТЧ;
		КонецЕсли;
		
		НоваяСтрока.Значение = Выборка.ЗначениеНовое;
		НоваяСтрока.Представление = Выборка.ПредставлениеНовое;
		НоваяСтрока.ДатаИзменения = Выборка.ДатаИзменения;
		
		НоваяСтрока.НомерВерсии = Выборка.Код;
		НоваяСтрока.НомерВерсииОписание = 
			"Версия из кэша код №" + Строка(НоваяСтрока.НомерВерсии) + Символы.ПС + 
			Выборка.Пользователь + " (" + Выборка.Компьютер + ")" + Символы.ПС + 
			Формат(Выборка.ДатаИзменения, "ДЛФ=DT");
	КонецЦикла;
	
	// ПЕРЕБИРАЕМ ТЗ И ЗАПОЛНЯЕМ СИНОНИМЫ
	//
	Для каждого Строки Из ТЗ Цикл
		Попытка
			ОбъектМетаданные = Строки.Объект.Метаданные();
		Исключение
			ОбъектМетаданные = Неопределено;
		КонецПопытки;
		
		ПредставлениеРеквизита = "";				
		
		Если НЕ ПустаяСтрока(Строки.ИмяТЧ) Тогда
			ПредставлениеТЧ = "";
			Строки.НомерСтрокиТЧОписание = "Строка №" + Строка(Строки.НомерСтрокиТЧ);
			
			Если ОбъектМетаданные <> Неопределено Тогда
				Попытка
					Реквизит = ОбъектМетаданные.ТабличныеЧасти[Строки.ИмяТЧ].Реквизиты[Строки.ИмяРеквизита];
					ПредставлениеРеквизита = Реквизит.Синоним;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Попытка
				Реквизит = ОбъектМетаданные.ТабличныеЧасти[Строки.ИмяТЧ];
				ПредставлениеТЧ = Реквизит.Синоним;
			Исключение
			КонецПопытки;
			
			Если ПустаяСтрока(ПредставлениеТЧ) Тогда
				Строки.ИмяТЧОписание = Строки.ИмяТЧ;
			Иначе
				Строки.ИмяТЧОписание = ПредставлениеТЧ;
			КонецЕсли;
			
		Иначе			
			Если ОбъектМетаданные <> Неопределено Тогда
				Попытка
					Реквизит = ОбъектМетаданные.Реквизиты[Строки.ИмяРеквизита];
					ПредставлениеРеквизита = Реквизит.Синоним;
				Исключение
				КонецПопытки;
				
				Если ПустаяСтрока(ПредставлениеРеквизита) Тогда
					Попытка
						Реквизит = ОбъектМетаданные.СтандартныеРеквизиты[Строки.ИмяРеквизита];
						ПредставлениеРеквизита = Реквизит.Синоним;
					Исключение
					КонецПопытки;					
				КонецЕсли;
				
				Если ПустаяСтрока(ПредставлениеРеквизита) Тогда
					Попытка
						Реквизит = ОбъектМетаданные.СтандартныеРеквизиты[Строки.ИмяРеквизита];
						ПредставлениеРеквизита = Реквизит.Синоним;
					Исключение
					КонецПопытки;					
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		
		// Не нашли синоним реквизита
		Если ПустаяСтрока(ПредставлениеРеквизита) Тогда
			Строки.ИмяРеквизитаОписание = Строки.ИмяРеквизита;
		Иначе
			Строки.ИмяРеквизитаОписание = ПредставлениеРеквизита;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьДанныеВнешнихНаборов
